introduction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-30 Mon 22:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Un réseau social mathématique</title>
<meta name="generator" content="Org mode" />
<link href="solarized-dark.min.css" rel="stylesheet"></link>
</head>
<body>
<div id="content">
<h1 class="title">Un réseau social mathématique</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd6a77b9">Introduction</a></li>
<li><a href="#org4bb59c5">Pourquoi un autre réseau social</a>
<ul>
<li><a href="#org2d426c6">Une base simple</a></li>
<li><a href="#org7be8424">Une base saine</a></li>
<li><a href="#org376aef3">Tester des idées</a></li>
</ul>
</li>
<li><a href="#org86b3e3f">Le réseau social cryptographique</a>
<ul>
<li><a href="#org0051701">Objets</a>
<ul>
<li><a href="#org348952d">Utilisateur</a></li>
<li><a href="#org002033b">Message</a></li>
<li><a href="#org92886a2">Evenement</a></li>
<li><a href="#org491f9a3">Communauté</a></li>
</ul>
</li>
<li><a href="#orge4b128b">Technologies</a>
<ul>
<li><a href="#orgfcd112e">Chiffrement</a></li>
<li><a href="#org0e49eca">Authentification</a></li>
<li><a href="#org39d91c3">Fonction de hachage cryptographie</a></li>
<li><a href="#orgb1f4b2a">Arbre cryptographique</a></li>
<li><a href="#orged7b5ab">Clés de chiffrement et de déchiffrement</a></li>
<li><a href="#org018b900">Clés de chiffrement uniquement</a></li>
<li><a href="#orgd6aa7ef">Clés d'authentification et de vérification</a></li>
</ul>
</li>
<li><a href="#org608ecf5">Messages</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd6a77b9" class="outline-2">
<h2 id="orgd6a77b9">Introduction</h2>
<div class="outline-text-2" id="text-orgd6a77b9">
<p>
Avec l'arrivée d'internet, la société n'a cessé de se copier-coller dans ce nouvel espace.
</p>

<p>
Cette nouvelle surface d'échange autorise l'émergence et la contemplation de nouvelles structures.
</p>

<p>
Une structure particulièrement vivace - le sujet de cette reflexion - c'est le réseau social.
</p>

<p>
Il est assujetti à un nouvel ensemble de règles, comme les platformes et les interfaces.
</p>

<p>
Son potentiel : Aider à recoder l'information pour décoder le réél.
</p>
</div>
</div>


<div id="outline-container-org4bb59c5" class="outline-2">
<h2 id="org4bb59c5">Pourquoi un autre réseau social</h2>
<div class="outline-text-2" id="text-org4bb59c5">
</div>
<div id="outline-container-org2d426c6" class="outline-3">
<h3 id="org2d426c6">Une base simple</h3>
<div class="outline-text-3" id="text-org2d426c6">
<ul class="org-ul">
<li>Pour pouvoir plus simplement s'assurer de ses propriétés mathématiques</li>
<li>Pour faciliter l'apprentissage et la construction de la technologie</li>
<li>Avoir un cadre autonome et suffisant, ne nécessitant pas d'autre technologies</li>
</ul>
</div>
</div>


<div id="outline-container-org7be8424" class="outline-3">
<h3 id="org7be8424">Une base saine</h3>
<div class="outline-text-3" id="text-org7be8424">
<ul class="org-ul">
<li>Un réseau social créé et appartenant à ses utilisateurs</li>
<li>Une informatique personnalisée et adaptable à chaque individu ou groupe d'individus</li>
</ul>
</div>
</div>


<div id="outline-container-org376aef3" class="outline-3">
<h3 id="org376aef3">Tester des idées</h3>
<div class="outline-text-3" id="text-org376aef3">
<ul class="org-ul">
<li>Utiliser des règles mathématiques et cryptographiques pour la gestion des droits de lecture et de modification
au lieu de déleguer cette tache à un serveur tiers.</li>
<li>Une platforme de recherche et de rencontre entre ses usager.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org86b3e3f" class="outline-2">
<h2 id="org86b3e3f">Le réseau social cryptographique</h2>
<div class="outline-text-2" id="text-org86b3e3f">
</div>
<div id="outline-container-org0051701" class="outline-3">
<h3 id="org0051701">Objets</h3>
<div class="outline-text-3" id="text-org0051701">
</div>
<div id="outline-container-org348952d" class="outline-4">
<h4 id="org348952d">Utilisateur</h4>
<div class="outline-text-4" id="text-org348952d">
<p>
C'est l'avatar d'un utilisateur sur la platforme.
</p>
</div>


<ul class="org-ul">
<li><a id="org407b94b"></a>Pseudo/Email/Identifiant<br />
<div class="outline-text-5" id="text-org407b94b">
<p>
C'est un outil permettant à la platforme de reconnaitre ses utilisateurs.
</p>

<p>
Nous n'avons pas besoin que l'utilisateur en choisisse un car il est déjà
uniquement identifiable par son adresse cryptographique.
</p>

<p>
Il est seulement intéressant pour l'utilisateur de choisir sous quel nom il apparait par défaut
</p>
</div>
</li>


<li><a id="orgbc3d2a7"></a>Mot de passe<br />
<div class="outline-text-5" id="text-orgbc3d2a7">
<p>
C'est un outil permettant à la platforme de reconnaitre ses utilisateurs.
</p>

<p>
Nous préférons une signature cryptographie ou un mot de passe à usage unique
pour ne pas embarasser l'utilisateur d'avoir à se souvenir d'un mot de passe
different pour chaque platforme qu'il utilise.
</p>
</div>
</li>
</ul>
</div>


<div id="outline-container-org002033b" class="outline-4">
<h4 id="org002033b">Message</h4>
<div class="outline-text-4" id="text-org002033b">
<p>
C'est le ciment du réseau social et sa fonction.
</p>
</div>
</div>


<div id="outline-container-org92886a2" class="outline-4">
<h4 id="org92886a2">Evenement</h4>
<div class="outline-text-4" id="text-org92886a2">
<p>
C'est une singularité du réseau. Une bulle qui contient ses propres membres et surtout ses propres messages.
</p>
</div>
</div>


<div id="outline-container-org491f9a3" class="outline-4">
<h4 id="org491f9a3">Communauté</h4>
<div class="outline-text-4" id="text-org491f9a3">
<p>
C'est un regroupement d'avatars, d'évenements et de messages.
</p>
</div>
</div>
</div>


<div id="outline-container-orge4b128b" class="outline-3">
<h3 id="orge4b128b">Technologies</h3>
<div class="outline-text-3" id="text-orge4b128b">
</div>
<div id="outline-container-orgfcd112e" class="outline-4">
<h4 id="orgfcd112e">Chiffrement</h4>
<div class="outline-text-4" id="text-orgfcd112e">
<p>
Un message peut ou non être chiffré par l'utilisateur.
</p>

<p>
Permet de se passer d'un tiers pour controller l'accès à l'information.
</p>

<p>
Un chiffrement cryptographique garanti que seul les possesseurs de la clé de déchiffrement pouront le lire.
</p>
</div>
</div>


<div id="outline-container-org0e49eca" class="outline-4">
<h4 id="org0e49eca">Authentification</h4>
<div class="outline-text-4" id="text-org0e49eca">
<p>
Un message peut ou non être signé par l'utilisateur.
</p>

<p>
Permet de se passer d'un tiers pour garantir l'authentification des données.
</p>

<p>
Une signature cryptographique prouve que ce message a bien été envoyé par l'utilisateur.
</p>
</div>
</div>


<div id="outline-container-org39d91c3" class="outline-4">
<h4 id="org39d91c3">Fonction de hachage cryptographie</h4>
<div class="outline-text-4" id="text-org39d91c3">
<p>
Une fonction de hachage cryptographie donne l'<b>empreinte cryptographique</b> d'un message.
</p>

<p>
L'empreinte cryptographique est suffisament longue et cryptique pour avoir ces deux propriétés :
</p>

<p>
Aucun autre message calculable n'a la même empreinte cryptographique.
</p>

<p>
Il n'est pas possible de retrouver le message seulement à partir de son empreinte.
</p>
</div>
</div>


<div id="outline-container-orgb1f4b2a" class="outline-4">
<h4 id="orgb1f4b2a">Arbre cryptographique</h4>
<div class="outline-text-4" id="text-orgb1f4b2a">
<p>
Un <b>arbre cryptographique</b> utilise une <b>graine cryptographique</b> pour générer
un ensemble de branches et feuilles qui peuvent toutes être utilisés comme <b>clés cryptographiques</b>
</p>
</div>
</div>


<div id="outline-container-orged7b5ab" class="outline-4">
<h4 id="orged7b5ab">Clés de chiffrement et de déchiffrement</h4>
<div class="outline-text-4" id="text-orged7b5ab">
<p>
Une <b>clé cryptographique</b> est un moyen de chiffrer (crypter) ou de déchiffrer des données.
</p>

<p>
Une clé de chiffrement <b>symétrique</b> permet de chiffrer et dechiffrer des données.
</p>

<p>
Ses possesseurs forment donc le groupe ayant le pouvoir de lire les messages chiffrés.
</p>
</div>
</div>


<div id="outline-container-org018b900" class="outline-4">
<h4 id="org018b900">Clés de chiffrement uniquement</h4>
<div class="outline-text-4" id="text-org018b900">
<p>
Une <b>clé de déchiffrement asymétrique</b> permet de génerer la <b>clé de chiffrement asymétrique</b> correspondante.
</p>

<p>
Une <b>clé de chiffrement asymétrique</b> permet de chiffrer des messages mais pas de les déchiffrer.
</p>

<p>
Ses possesseurs peuvent donc uniquement chiffrer des messages, sans pouvoir les relire.
</p>

<p>
Seul le (ou les) possesseur(s) de la <b>clé de déchiffrement</b> correspondante a(ont) le pouvoir de les lire.
</p>
</div>
</div>


<div id="outline-container-orgd6aa7ef" class="outline-4">
<h4 id="orgd6aa7ef">Clés d'authentification et de vérification</h4>
<div class="outline-text-4" id="text-orgd6aa7ef">
<p>
Une <b>clé de signature cryptographique</b> de permet d'authentifier un message.
</p>

<p>
Elle permet aussi de générer la <b>clé de verification cryptographique</b> correspondante.
</p>

<p>
La <b>clé de vérification</b> peut être partagée afin de rendre possible la vérifaction des messages signés.
</p>
</div>
</div>
</div>


<div id="outline-container-org608ecf5" class="outline-3">
<h3 id="org608ecf5">Messages</h3>
<div class="outline-text-3" id="text-org608ecf5">
<ul class="org-ul">
<li>Un message <b>en clair</b> est publiquement lisible.</li>

<li>Un message avec <b>zero information</b> est complétement illisible avant d'être dechiffré.
Aucune information n'est disponible pour savoir quelle clé peut le déchiffrer.</li>

<li>Un message avec <b>adresse publique</b> identifie <b>la clé de déchiffrement asymétrique</b> permettant de le déchiffrer.</li>

<li>Un message avec <b>empreinte d'adresse publique</b> identifie l'<b>empreinte</b> de la <b>clé de déchiffrement asymétrique</b> permettant de le déchiffrer.</li>

<li>Un message avec <b>signature cryptographique</b> est authentifiable par la <b>clé de vérification</b></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-03-30 Mon 22:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
